---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemSpanactiveDirn2
source: html/4d0a94a1-fa01-6589-564b-a6b4377e654f.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemSpanactiveDirn2 Property

"Bars In Minor Direction"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemSpanactiveDirn2 { get; }
```